<div id="wdl-post-<?php the_ID(); ?>" class="swiper-slide card wdl-archive-card wdl-consultant-card">
  <?php
  $gallery = get_field('Gallery');
  $profilePhoto = get_field('ProfilePhoto');
  $logo = get_field('Logo'); ?>
  
  <div class="cover">
    <?php if ($gallery) { ?>
    <img loading="lazy" src="<?php echo $gallery[0]['sizes']['w425']?>" alt="<?php echo get_the_title(); ?>">
    <?php } ?>

    <?php $status = get_field('Status');
      if ($status && in_array('Sponsored', $status)): ?>
      <span class="badge wdl-badge-sm"><?php _e('ที่ปรึกษาดีเด่น')?></span>
    <?php endif; ?>
  </div>

  <?php if ($profilePhoto): ?>
    <div aria-label="<?php echo get_the_title(); ?>" title="<?php echo get_the_title(); ?>" class="card-img-top" href="<?php the_permalink(); ?>">
      <img class="profile-photo" loading="lazy" src="<?php echo $profilePhoto['sizes']['w425'] ?>" alt="<?php echo get_the_title(); ?>">
      <?php if($logo) { ?>
      <img class="logo" loading="lazy" src="<?php echo $logo['sizes']['thumbnail'] ?>" alt="<?php echo get_the_title(); ?>">
      <?php } ?>
      
      <div class="swiper-lazy-preloader"></div>
    </div>
  <?php endif; ?>

  <div class="card-body wdl-archive-card-body">
    <h3 class="title mb-0 lineclamp-1">
      <?php the_title(); ?>
    </h3>

    <div class="subtitle lineclamp-1">
      <?php $consultantType = get_field('ConsultantType');
      if ($consultantType) {
        foreach ($consultantType as $item) {
          echo $item->name;
        }
      }
      ?>
    </div>

    <?php if(get_the_excerpt()) {?>
    <p class="excerpt lineclamp-2 mb-0">
      <?php echo (get_the_excerpt()); ?>
    </p>
    <?php } ?>


    <?php if (have_rows('Pricing')): ?>
    <div class="pricing">
      <?php while (have_rows('Pricing')):
      the_row();
      if (get_sub_field('PricingName')): ?>
      <div class="lineclamp-1 text">
        <?php echo get_sub_field('PricingName').' '.number_format(get_sub_field('PricingStart')).' '.get_sub_field('PricingUnit'); ?>
      </div>
      <?php endif;
      endwhile; ?>
    </div>
    <?php endif; ?>

    <button class="wdl-btn w-100 mt-1 wdl-btn-line-contact"
      data-text="<?php echo __('ติดต่อนัดที่ปรึกษา', 'wdl').' '.get_the_title() ?>"
    >
      <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M18.7582 7.50187L18.7583 7.50181L18.7528 7.45567C18.7527 7.45488 18.7526 7.45428 18.7525 7.45349C18.7525 7.45282 18.7524 7.45221 18.7523 7.45155L18.7314 7.27806C18.7272 7.24321 18.7224 7.20351 18.7169 7.15823L18.7126 7.12217L18.7036 7.12327C18.4841 5.87455 17.8809 4.68952 16.9468 3.67767C16.017 2.67067 14.809 1.87559 13.4535 1.37838C12.2921 0.952368 11.0597 0.736328 9.79088 0.736328C8.07785 0.736328 6.41418 1.13921 4.97978 1.90139C2.21374 3.37106 0.582425 6.07244 0.823535 8.78354C0.94834 10.1864 1.49794 11.5218 2.41297 12.6455C3.27422 13.7031 4.43928 14.5566 5.78214 15.1137C6.60782 15.4561 7.42421 15.6176 8.28861 15.7884L8.3898 15.8085C8.62782 15.8556 8.6918 15.9203 8.70831 15.9459C8.73884 15.9935 8.72288 16.0873 8.71062 16.1389C8.69932 16.1866 8.68767 16.2341 8.67601 16.2817C8.5832 16.6602 8.48723 17.0516 8.56262 17.4831C8.64931 17.9792 8.95907 18.2637 9.41252 18.2638H9.41264C9.90038 18.2638 10.4555 17.9366 10.8228 17.7201L10.8719 17.6913C11.7482 17.1766 12.5737 16.5961 13.195 16.1479C14.5546 15.167 16.0956 14.0552 17.2509 12.6168C18.4142 11.1682 18.9622 9.30661 18.7582 7.50187ZM6.4055 10.2465H4.85261C4.61793 10.2465 4.42769 10.0562 4.42769 9.82155V6.56207C4.42769 6.3274 4.61793 6.13715 4.85261 6.13715C5.08728 6.13715 5.27752 6.3274 5.27752 6.56207V9.39664H6.40544C6.64011 9.39664 6.83035 9.58688 6.83035 9.82155C6.83042 10.0562 6.64017 10.2465 6.4055 10.2465ZM8.02547 9.81002C8.02547 10.0447 7.83522 10.2349 7.60055 10.2349C7.36587 10.2349 7.17563 10.0447 7.17563 9.81002V6.55054C7.17563 6.31586 7.36587 6.12562 7.60055 6.12562C7.83522 6.12562 8.02547 6.31586 8.02547 6.55054V9.81002ZM11.8664 9.81002C11.8664 9.99413 11.7478 10.1573 11.5727 10.2142C11.5295 10.2282 11.4852 10.235 11.4415 10.235C11.308 10.235 11.1791 10.1719 11.0976 10.0597L9.56743 7.95228V9.81008C9.56743 10.0448 9.37719 10.235 9.14251 10.235C8.90784 10.235 8.7176 10.0448 8.7176 9.81008V6.64384C8.7176 6.45973 8.83615 6.29656 9.01128 6.23968C9.18646 6.18286 9.37822 6.24514 9.48639 6.39417L11.0165 8.50158V6.55054C11.0165 6.31586 11.2068 6.12562 11.4414 6.12562C11.6761 6.12562 11.8664 6.31586 11.8664 6.55054V9.81002ZM14.9626 10.168H12.8596C12.6249 10.168 12.4347 9.9778 12.4347 9.74313V8.11345V6.48364C12.4347 6.24897 12.6249 6.05873 12.8596 6.05873H14.8974C15.132 6.05873 15.3223 6.24897 15.3223 6.48364C15.3223 6.71832 15.132 6.90856 14.8974 6.90856H13.2845V7.68853H14.5934C14.828 7.68853 15.0183 7.87877 15.0183 8.11345C15.0183 8.34812 14.828 8.53836 14.5934 8.53836H13.2845V9.31821H14.9626C15.1973 9.31821 15.3875 9.50845 15.3875 9.74313C15.3875 9.9778 15.1973 10.168 14.9626 10.168Z" fill="white"/>
      </svg>

      <span><?php _e('นัดปรึกษา', 'wdl')?></span>
    </button>
  </div>

  <div class="card-hover">
    <div class="head">
      <img class="profile-photo" loading="lazy" src="<?php echo $profilePhoto['sizes']['w425'] ?>" alt="<?php the_title(); ?>">
      <div class="info">
        <p class="title mb-0 lineclamp-1"><?php the_title(); ?></p>
        <div class="subtitle lineclamp-1">
          <?php $consultantType = get_field('ConsultantType');
          if ($consultantType) {
            foreach ($consultantType as $item) {
              echo $item->name;
            }
          }
          ?>
        </div>
      </div>
    </div>
    <div class="body">
      <?php if(get_the_excerpt()) {?>
      <p class="excerpt">
        <?php echo (get_the_excerpt()); ?>
      </p>
      <?php } ?>

      <?php if ($gallery) { ?>
      <div class="swiper wdl-consultant-gallery-swiper gallery overflow-visible">
        <div class="swiper-wrapper">
          <?php foreach ($gallery as $item) { ?>
            <div class="swiper-slide">
              <img loading="lazy" src="<?php echo $item['sizes']['w425'] ?>" alt="<?php the_title(); ?>">
            </div>
          <?php } ?>
        </div>
        <div class="swiper-navigation swiper-navigation-small">
          <div class="swiper-button-prev"></div>
          <div class="swiper-button-next"></div>
        </div>
        <div class="swiper-pagination"></div>
      </div>
      <?php } ?>
    </div>

    <button class="wdl-btn w-100 mt-1 wdl-btn-line-contact"
      data-text="<?php echo __('ติดต่อนัดที่ปรึกษา', 'wdl').' '.get_the_title() ?>"
      data-dlev="cardClick"
      data-dlcomp="card - consultant"
      data-dltgt="<?php esc_attr(get_the_title())?>"
    >
      <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M18.7582 7.50187L18.7583 7.50181L18.7528 7.45567C18.7527 7.45488 18.7526 7.45428 18.7525 7.45349C18.7525 7.45282 18.7524 7.45221 18.7523 7.45155L18.7314 7.27806C18.7272 7.24321 18.7224 7.20351 18.7169 7.15823L18.7126 7.12217L18.7036 7.12327C18.4841 5.87455 17.8809 4.68952 16.9468 3.67767C16.017 2.67067 14.809 1.87559 13.4535 1.37838C12.2921 0.952368 11.0597 0.736328 9.79088 0.736328C8.07785 0.736328 6.41418 1.13921 4.97978 1.90139C2.21374 3.37106 0.582425 6.07244 0.823535 8.78354C0.94834 10.1864 1.49794 11.5218 2.41297 12.6455C3.27422 13.7031 4.43928 14.5566 5.78214 15.1137C6.60782 15.4561 7.42421 15.6176 8.28861 15.7884L8.3898 15.8085C8.62782 15.8556 8.6918 15.9203 8.70831 15.9459C8.73884 15.9935 8.72288 16.0873 8.71062 16.1389C8.69932 16.1866 8.68767 16.2341 8.67601 16.2817C8.5832 16.6602 8.48723 17.0516 8.56262 17.4831C8.64931 17.9792 8.95907 18.2637 9.41252 18.2638H9.41264C9.90038 18.2638 10.4555 17.9366 10.8228 17.7201L10.8719 17.6913C11.7482 17.1766 12.5737 16.5961 13.195 16.1479C14.5546 15.167 16.0956 14.0552 17.2509 12.6168C18.4142 11.1682 18.9622 9.30661 18.7582 7.50187ZM6.4055 10.2465H4.85261C4.61793 10.2465 4.42769 10.0562 4.42769 9.82155V6.56207C4.42769 6.3274 4.61793 6.13715 4.85261 6.13715C5.08728 6.13715 5.27752 6.3274 5.27752 6.56207V9.39664H6.40544C6.64011 9.39664 6.83035 9.58688 6.83035 9.82155C6.83042 10.0562 6.64017 10.2465 6.4055 10.2465ZM8.02547 9.81002C8.02547 10.0447 7.83522 10.2349 7.60055 10.2349C7.36587 10.2349 7.17563 10.0447 7.17563 9.81002V6.55054C7.17563 6.31586 7.36587 6.12562 7.60055 6.12562C7.83522 6.12562 8.02547 6.31586 8.02547 6.55054V9.81002ZM11.8664 9.81002C11.8664 9.99413 11.7478 10.1573 11.5727 10.2142C11.5295 10.2282 11.4852 10.235 11.4415 10.235C11.308 10.235 11.1791 10.1719 11.0976 10.0597L9.56743 7.95228V9.81008C9.56743 10.0448 9.37719 10.235 9.14251 10.235C8.90784 10.235 8.7176 10.0448 8.7176 9.81008V6.64384C8.7176 6.45973 8.83615 6.29656 9.01128 6.23968C9.18646 6.18286 9.37822 6.24514 9.48639 6.39417L11.0165 8.50158V6.55054C11.0165 6.31586 11.2068 6.12562 11.4414 6.12562C11.6761 6.12562 11.8664 6.31586 11.8664 6.55054V9.81002ZM14.9626 10.168H12.8596C12.6249 10.168 12.4347 9.9778 12.4347 9.74313V8.11345V6.48364C12.4347 6.24897 12.6249 6.05873 12.8596 6.05873H14.8974C15.132 6.05873 15.3223 6.24897 15.3223 6.48364C15.3223 6.71832 15.132 6.90856 14.8974 6.90856H13.2845V7.68853H14.5934C14.828 7.68853 15.0183 7.87877 15.0183 8.11345C15.0183 8.34812 14.828 8.53836 14.5934 8.53836H13.2845V9.31821H14.9626C15.1973 9.31821 15.3875 9.50845 15.3875 9.74313C15.3875 9.9778 15.1973 10.168 14.9626 10.168Z" fill="white"/>
      </svg>

      <span><?php _e('นัดปรึกษา', 'wdl')?></span>
    </button>
  </div>
</div>